In [38]:
import pandas as pd
df = pd.read_excel('task1_salary.xls')
df['Sum'] = df['Base']+df['Bonus']
TotalYear = df['Base'].sum() + df['Bonus'].sum()
print( 'Year: ', TotalYear)
df

Year:  829899

        Month   Base  Bonus    Sum
0     January  38400  18442  56842
1    February  45600  16485  62085
2       March  52800  17117  69917
3       April  50400  27468  77868
4         May  45600  26107  71707
5        June  50400   2054  52454
6        July  50400  16414  66814
7      August  55200   1794  56994
8   September  52800  25200  78000
9     October  50400  23505  73905
10   November  52800  29623  82423
11   December  52800  28090  80890